yenchouRJ/nuc990_non-os/Library/StdDriver/src/sys.c
/**************************************************************************//**
 * @file     sys.c
 * @brief    SYS driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include <stdio.h>
#include "NuMicro.h"
#include "sys.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup SYS_Driver SYS Driver
  @{
*/

/** @addtogroup SYS_EXPORTED_CONSTANTS SYS Exported Constants
  @{
*/

#define AIC_MIN_INT_SOURCE       1
#define AIC_MAX_INT_SOURCE       82
#define AIC_NUM_OF_AICREG        16  // ..... check

/* Global variables */
UINT32 volatile _sys_bIsAICInitial = 0;

/* declaration the function prototype */
void IRQ_Shell(void);
void FIQ_Shell(void);

/* Interrupt Handler Table */
sys_pvFunPtr IrqHandlerTable[AIC_MAX_INT_SOURCE+1] = {
                                      0,           /* 0, Reserved */
                                      IRQ_Shell,   /* 1 */
                                      IRQ_Shell,   /* 2 */
                                      IRQ_Shell,   /* 3 */
                                      IRQ_Shell,   /* 4 */
                                      IRQ_Shell,   /* 5 */
                                      IRQ_Shell,   /* 6 */
                                      IRQ_Shell,   /* 7 */
                                      IRQ_Shell,   /* 8 */
                                      IRQ_Shell,   /* 9 */
                                      IRQ_Shell,   /* 10 */
                                      IRQ_Shell,   /* 11 */
                                      IRQ_Shell,   /* 12 */
                                      IRQ_Shell,   /* 13 */
                                      IRQ_Shell,   /* 14 */
                                      IRQ_Shell,   /* 15 */
                                      IRQ_Shell,   /* 16 */
                                      IRQ_Shell,   /* 17 */
                                      IRQ_Shell,   /* 18 */
                                      IRQ_Shell,   /* 19 */
                                      IRQ_Shell,   /* 20 */
                                      IRQ_Shell,   /* 21 */
                                      IRQ_Shell,   /* 22 */
                                      IRQ_Shell,   /* 23 */
                                      IRQ_Shell,   /* 24 */
                                      IRQ_Shell,   /* 25 */
                                      IRQ_Shell,   /* 26 */
                                      IRQ_Shell,   /* 27 */
                                      IRQ_Shell,   /* 28 */
                                      IRQ_Shell,   /* 29 */
                                      IRQ_Shell,   /* 30 */
                                      IRQ_Shell,   /* 31 */
                                      IRQ_Shell,   /* 32 */
                                      IRQ_Shell,   /* 33 */
                                      IRQ_Shell,   /* 34 */
                                      IRQ_Shell,   /* 35 */
                                      IRQ_Shell,   /* 36 */
                                      IRQ_Shell,   /* 37 */
                                      IRQ_Shell,   /* 38 */
                                      IRQ_Shell,   /* 39 */
                                      IRQ_Shell,   /* 40 */
                                      IRQ_Shell,   /* 41 */
                                      IRQ_Shell,   /* 42 */
                                      IRQ_Shell,   /* 43 */
                                      IRQ_Shell,   /* 44 */
                                      IRQ_Shell,   /* 45 */
                                      IRQ_Shell,   /* 46 */
                                      IRQ_Shell,   /* 47 */
                                      IRQ_Shell,   /* 48 */
                                      IRQ_Shell,   /* 49 */
                                      IRQ_Shell,   /* 50 */
                                      IRQ_Shell,   /* 51 */
                                      IRQ_Shell,   /* 52 */
                                      IRQ_Shell,   /* 53 */
                                      IRQ_Shell,   /* 54 */
                                      IRQ_Shell,   /* 55 */
                                      IRQ_Shell,   /* 56 */
                                      IRQ_Shell,   /* 57 */
                                      IRQ_Shell,   /* 58 */
                                      IRQ_Shell,   /* 59 */
                                      IRQ_Shell,   /* 60 */
                                      IRQ_Shell,   /* 61 */
                                      IRQ_Shell,   /* 62 */
                                      IRQ_Shell,   /* 63 */
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell,
									  IRQ_Shell    /* 82 */
                                    };

sys_pvFunPtr FiqHandlerTable[AIC_MAX_INT_SOURCE+1] = {
                                      0,           /* 0, Reserved */
                                      FIQ_Shell,   /* 1 */
                                      FIQ_Shell,   /* 2 */
                                      FIQ_Shell,   /* 3 */
                                      FIQ_Shell,   /* 4 */
                                      FIQ_Shell,   /* 5 */
                                      FIQ_Shell,   /* 6 */
                                      FIQ_Shell,   /* 7 */
                                      FIQ_Shell,   /* 8 */
                                      FIQ_Shell,   /* 9 */
                                      FIQ_Shell,   /* 10 */
                                      FIQ_Shell,   /* 11 */
                                      FIQ_Shell,   /* 12 */
                                      FIQ_Shell,   /* 13 */
                                      FIQ_Shell,   /* 14 */
                                      FIQ_Shell,   /* 15 */
                                      FIQ_Shell,   /* 16 */
                                      FIQ_Shell,   /* 17 */
                                      FIQ_Shell,   /* 18 */
                                      FIQ_Shell,   /* 19 */
                                      FIQ_Shell,   /* 20 */
                                      FIQ_Shell,   /* 21 */
                                      FIQ_Shell,   /* 22 */
                                      FIQ_Shell,   /* 23 */
                                      FIQ_Shell,   /* 24 */
                                      FIQ_Shell,   /* 25 */
                                      FIQ_Shell,   /* 26 */
                                      FIQ_Shell,   /* 27 */
                                      FIQ_Shell,   /* 28 */
                                      FIQ_Shell,   /* 29 */
                                      FIQ_Shell,   /* 30 */
                                      FIQ_Shell,   /* 31 */
                                      FIQ_Shell,   /* 32 */
                                      FIQ_Shell,   /* 33 */
                                      FIQ_Shell,   /* 34 */
                                      FIQ_Shell,   /* 35 */
                                      FIQ_Shell,   /* 36 */
                                      FIQ_Shell,   /* 37 */
                                      FIQ_Shell,   /* 38 */
                                      FIQ_Shell,   /* 39 */
                                      FIQ_Shell,   /* 40 */
                                      FIQ_Shell,   /* 41 */
                                      FIQ_Shell,   /* 42 */
                                      FIQ_Shell,   /* 43 */
                                      FIQ_Shell,   /* 44 */
                                      FIQ_Shell,   /* 45 */
                                      FIQ_Shell,   /* 46 */
                                      FIQ_Shell,   /* 47 */
                                      FIQ_Shell,   /* 48 */
                                      FIQ_Shell,   /* 49 */
                                      FIQ_Shell,   /* 50 */
                                      FIQ_Shell,   /* 51 */
                                      FIQ_Shell,   /* 52 */
                                      FIQ_Shell,   /* 53 */
                                      FIQ_Shell,   /* 54 */
                                      FIQ_Shell,   /* 55 */
                                      FIQ_Shell,   /* 56 */
                                      FIQ_Shell,   /* 57 */
                                      FIQ_Shell,   /* 58 */
                                      FIQ_Shell,   /* 59 */
                                      FIQ_Shell,   /* 60 */
                                      FIQ_Shell,   /* 61 */
                                      FIQ_Shell,   /* 62 */
                                      FIQ_Shell,   /* 63 */
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell,
									  FIQ_Shell    /* 82 */
                                    };

/* Interrupt Handler */
#if defined (__GNUC__) && !(__CC_ARM)
static void __attribute__ ((interrupt("IRQ"))) IrqHandler(void)
#else
__irq void IrqHandler()
#endif
{
    UINT32 volatile num;

    num = AIC->IRQ;
    if (num != 0)
        (*IrqHandlerTable[num])();

    AIC->IRQRST = 1;
}

#if defined (__GNUC__) && !(__CC_ARM)
static void __attribute__ ((interrupt("FIQ"))) FiqHandler(void)
#else
__irq void FiqHandler()
#endif
{
    UINT32 volatile num;

