yenchouRJ/nuc990_non-os/Library/StdDriver/src/sys.c
    num = AIC->FIQ;
    if (num != 0)
        (*FiqHandlerTable[num])();

    AIC->FIQRST = 1;
}

void IRQ_Shell(void)
{
    printf("ISR not found! IRQ_Num=%d\n", AIC->IRQ);
}

void FIQ_Shell(void)
{
    printf("ISR not found! FIQ_Num=%d\n", AIC->FIQ);
}

void sysInitializeAIC()
{
    *(unsigned int volatile *)0x38 = (unsigned int)IrqHandler;
    *(unsigned int volatile *)0x3C = (unsigned int)FiqHandler;
}

/*@}*/ /* end of group SYS_EXPORTED_CONSTANTS */


/** @addtogroup SYS_EXPORTED_FUNCTIONS SYS Exported Functions
  @{
*/

/* Interrupt library functions */
/**
 *  @brief  system AIC - disable interrupt
 *
 *  @param[in]  eIntNo  Select interrupt source.  \ref IRQn_Type
 *
 *  @return   0
 */
INT32 sysDisableInterrupt(IRQn_Type eIntNo)
{
	uint32_t u32IDIS = 0UL;

    if ((eIntNo > AIC_MAX_INT_SOURCE) || (eIntNo < AIC_MIN_INT_SOURCE))
        return Fail;

    u32IDIS = (uint32_t)&AIC->IDIS0 + ((eIntNo / 32UL) * 4UL);
	M32(u32IDIS) = 1UL << (eIntNo % 32UL);

    return Successful;
}

/**
 *  @brief  system AIC - enable interrupt
 *
 *  @param[in]  eIntNo  Select interrupt source.  \ref IRQn_Type
 *
 *  @return   0
 */
INT32 sysEnableInterrupt(IRQn_Type eIntNo)
{
	uint32_t u32IEN = 0UL;

    if ((eIntNo > AIC_MAX_INT_SOURCE) || (eIntNo < AIC_MIN_INT_SOURCE))
        return Fail;

    u32IEN = (uint32_t)&AIC->IEN0 + ((eIntNo / 32UL) * 4UL);
	M32(u32IEN) = 1UL << (eIntNo % 32UL);

    return Successful;
}

/**
 *  @brief  system AIC - install exception handler
 *
 *  @param[in]  nExceptType  exception type. ( \ref SYS_SWI / \ref SYS_D_ABORT / \ref SYS_I_ABORT / \ref SYS_UNDEFINE)
 *  @param[in]  pvNewHandler  own exception handler
 *
 *  @return   old handler
 */
PVOID sysInstallExceptionHandler(INT32 nExceptType, PVOID pvNewHandler)
{
    PVOID _mOldVect = NULL;

    switch (nExceptType)
    {
		case SYS_SWI:
			_mOldVect = *(PVOID volatile *)0x28;
			*(PVOID volatile *)0x28 = pvNewHandler;
			break;

		case SYS_D_ABORT:
			_mOldVect = *(PVOID volatile *)0x30;
			*(PVOID volatile *)0x30 = pvNewHandler;
			break;

		case SYS_I_ABORT:
			_mOldVect = *(PVOID volatile *)0x2C;
			*(PVOID volatile *)0x2C = pvNewHandler;
			break;

		case SYS_UNDEFINE:
			_mOldVect = *(PVOID volatile *)0x24;
			*(PVOID volatile *)0x24 = pvNewHandler;
			break;

		default:
			;
    }
    return _mOldVect;
}

/**
 *  @brief  system AIC - install FIQ handler
 *
 *  @param[in]  pvNewISR  own fiq handler
 *
 *  @return   old handler
 */
PVOID sysInstallFiqHandler(PVOID pvNewISR)
{
    PVOID _mOldVect;

    _mOldVect = *(PVOID volatile *)0x3C;
    *(PVOID volatile *)0x3C = pvNewISR;
    return _mOldVect;
}

/**
 *  @brief  system AIC - install IRQ handler
 *
 *  @param[in]  pvNewISR  own irq handler
 *
 *  @return   old handler
 */
PVOID sysInstallIrqHandler(PVOID pvNewISR)
{
    PVOID _mOldVect;

    _mOldVect = *(PVOID volatile *)0x38;
    *(PVOID volatile *)0x38 = pvNewISR;
    return _mOldVect;
}

/**
 *  @brief  system AIC - install Own IRQ service routine
 *
 *  @param[in]  nIntTypeLevel   Interrupt Level. ( \ref FIQ_LEVEL_0 / \ref IRQ_LEVEL_1 / \ref IRQ_LEVEL_2 / \ref IRQ_LEVEL_3 /
 *                                                 \ref IRQ_LEVEL_4 / \ref IRQ_LEVEL_5 / \ref IRQ_LEVEL_6 / \ref IRQ_LEVEL_7 )
 *  @param[in]  eIntNo  Interrupt number. \ref IRQn_Type
 *  @param[in]  pvNewISR  own IRQ handler
 *
 *  @return   old handler
 */
PVOID sysInstallISR(INT32 nIntTypeLevel, IRQn_Type eIntNo, PVOID pvNewISR)
{
    PVOID   _mOldVect;
    UINT32  _mRegAddr;
    INT     shift;

    if (!_sys_bIsAICInitial)
    {
#if 0  // temporarily ..... for compatibility with the original test code
        CLK_EnableModuleClock(AIC_MODULE);
#else
        CLK->PCLKEN0 |= 0x8;
#endif
        sysInitializeAIC();
        _sys_bIsAICInitial = TRUE;
    }

    _mRegAddr = (uint32_t)&AIC->SRC00 + ((eIntNo / 4) * 4);
    shift = (eIntNo % 4) * 8;
    nIntTypeLevel &= 0x7;

    outpw(_mRegAddr, (inpw(_mRegAddr) & ~(0x7 << shift)) | (nIntTypeLevel << shift));

    if ((nIntTypeLevel & 0x7) == FIQ_LEVEL_0)
    {
        _mOldVect = (PVOID) FiqHandlerTable[eIntNo];
        FiqHandlerTable[eIntNo] = (sys_pvFunPtr)pvNewISR;
    }
    else
    {
        _mOldVect = (PVOID) IrqHandlerTable[eIntNo];
        IrqHandlerTable[eIntNo] = (sys_pvFunPtr)pvNewISR;
    }
    return _mOldVect;
}

INT32 sysSetGlobalInterrupt(INT32 nIntState)
{
    switch (nIntState)
    {
		case ENABLE_ALL_INTERRUPTS:
			AIC->IEN0 = 0xFFFFFFFF;
			AIC->IEN1 = 0xFFFFFFFF;
			AIC->IEN2 = 0xFFFFFFFF;
			break;

		case DISABLE_ALL_INTERRUPTS:
			AIC->IDIS0 = 0xFFFFFFFF;
			AIC->IDIS1 = 0xFFFFFFFF;
			AIC->IDIS2 = 0xFFFFFFFF;
			break;

		default:
			;
    }
    return Successful;
}

/**
 *  @brief  system AIC - Change interrupt level
 *
 *  @param[in]  eIntNo  Interrupt number. \ref IRQn_Type
 *  @param[in]  uIntLevel   Interrupt Level. ( \ref FIQ_LEVEL_0 / \ref IRQ_LEVEL_1 / \ref IRQ_LEVEL_2 / \ref IRQ_LEVEL_3 /
 *                                             \ref IRQ_LEVEL_4 / \ref IRQ_LEVEL_5 / \ref IRQ_LEVEL_6 / \ref IRQ_LEVEL_7 )
 *
 *  @return   0
 */
INT32 sysSetInterruptPriorityLevel(IRQn_Type eIntNo, UINT32 uIntLevel)
{
    UINT32  _mRegAddr;
    INT     shift;

    if ((eIntNo > AIC_MAX_INT_SOURCE) || (eIntNo < AIC_MIN_INT_SOURCE))
        return Fail;

    _mRegAddr = (uint32_t)&AIC->SRC00 + ((eIntNo / 4) * 4);
    shift = (eIntNo % 4) * 8;
    uIntLevel &= 0x7;

    outpw(_mRegAddr, (inpw(_mRegAddr) & ~(0x7 << shift)) | (uIntLevel << shift));

    return Successful;
}

/**
 *  @brief  system AIC - Set CP15 Interrupt Type
 *
 *  @param[in]  nIntState   Interrupt state. ( \ref ENABLE_IRQ / \ref ENABLE_FIQ / \ref ENABLE_FIQ_IRQ /
 *                                             \ref DISABLE_IRQ / \ref DISABLE_FIQ / \ref DISABLE_FIQ_IRQ)
 *
 *  @return   0
 */
INT32 sysSetLocalInterrupt(INT32 nIntState)
{
#if defined (__GNUC__) && !(__CC_ARM)
#else
    INT32 temp;
#endif

    switch (nIntState)
    {
        case ENABLE_IRQ:
        case ENABLE_FIQ:
        case ENABLE_FIQ_IRQ:
#if defined (__GNUC__) && !(__CC_ARM)
        asm
            (
                "mrs    r0, CPSR  \n"
                "bic    r0, r0, #0x80  \n"
                "msr    CPSR_c, r0  \n"
            );
#else
            __asm
            {
                MRS    temp, CPSR
                AND    temp, temp, nIntState
                MSR    CPSR_c, temp
            }
#endif
            break;

            case DISABLE_IRQ:
            case DISABLE_FIQ:
            case DISABLE_FIQ_IRQ:
#if defined ( __GNUC__ ) && !(__CC_ARM)
            asm
                (
                    "MRS    r0, CPSR  \n"
                    "ORR    r0, r0, #0x80  \n"
                    "MSR    CPSR_c, r0  \n"
                );
#else
            __asm
            {
                MRS    temp, CPSR
                ORR    temp, temp, nIntState
                MSR    CPSR_c, temp
            }
#endif
            break;

            default:
			;
    }
    return 0;
}

UINT32  sysGetInterruptEnableStatus(void)
{
    return (AIC->IE0);
}

UINT32  sysGetInterruptEnableStatusH(void)
{
    return (AIC->IE1);
}

/**
 *  @brief  system AIC - Get Interrupt Enable Status
 *
 *  @param[in]  eIntNo  Interrupt number. \ref IRQn_Type
 *
 *  @return   0 (Disable) / 1 (Enable)
 */
INT32 sysGetIEStatus(IRQn_Type eIntNo)
{
    uint32_t u32IsEnable;
    uint32_t u32IEN = 0UL;

