yenchouRJ/nuc990_non-os/Library/StdDriver/src/sys.c
    if ((eIntNo >= AIC_MIN_INT_SOURCE) && (eIntNo <= AIC_MAX_INT_SOURCE))
    {
        u32IEN = (uint32_t)&AIC->IE0 + ((eIntNo / 32UL) * 4UL);
        u32IsEnable = (M32(u32IEN) >> (eIntNo % 32UL)) & 0x1;
    }
    else
    {
        u32IsEnable = 0;
    }

    return (u32IsEnable);
}

BOOL sysGetIBitState(void)
{
    INT32 temp;
#if defined (__GNUC__) && !(__CC_ARM)
    asm
    (
        "MRS %0, CPSR   \n"
        :"=r" (temp) : :
    );
#else
    __asm
    {
        MRS temp, CPSR
    }
#endif

    if (temp & 0x80)
        return FALSE;
    else
        return TRUE;
}

INT32 sysGetPLL(UINT32 reg)
{
    UINT32 N,M,P;
    N =((inpw(reg) & 0x007F)>>0)+1;
    M =((inpw(reg) & 0x1F80)>>7)+1;
    P =((inpw(reg) & 0xE000)>>13)+1;
    return (__HXT*N/(M*P));    /* 12MHz HXT */
}

UINT32 sysGetClock(CLK_Type clk)
{
    UINT32 src, divN, reg;

    switch(clk)
    {
        case SYS_UPLL:
            return sysGetPLL(REG_CLK_UPLLCON);

        case SYS_APLL:
            return sysGetPLL(REG_CLK_APLLCON);

        case SYS_SYSTEM:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = __HXT;
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            return src;
        }

        case SYS_HCLK:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = __HXT;
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            return (src / 2);
        }

        case SYS_PCLK01:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = __HXT;
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            return (src / 2);
        }

        case SYS_CPU:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = __HXT;   /* HXT */
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            divN = ((reg & 0x100) >> 8) + 1;
            return (src / divN);
        }

        case SYS_PCLK2:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = __HXT;
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            return (src / 4);
        }

        default:
            ;
    }

    return 0;
}

INT32 sysGetSdramSizebyMB(void)
{
    unsigned int volatile reg, totalsize=0;

    reg = inpw(SDIC_BASE+0x10) & 0x07;
    switch(reg)
    {
        case 1:
            totalsize += 2;
            break;

        case 2:
            totalsize += 4;
            break;

        case 3:
            totalsize += 8;
            break;

        case 4:
            totalsize += 16;
            break;

        case 5:
            totalsize += 32;
            break;

        case 6:
            totalsize += 64;
            break;

        case 7:
            totalsize += 128;
            break;
    }

    if((inpw(SDIC_BASE+0x14) & (0xFF<<21)) !=0)
        totalsize +=totalsize;

    return totalsize;
}

/**
  * @brief      Reset selected module
  * @param[in]  u32ModuleIndex is module index. Including :
  *             - \ref PDMA0_RST
  *             - \ref PDMA1_RST
  *             - \ref PDMA2_RST
  *             - \ref PDMA3_RST
  *             - \ref DISPC_RST
  *             - \ref VCAP0_RST
  *             - \ref VCAP1_RST
  *             - \ref GFX_RST
  *             - \ref VDEC_RST
  *             - \ref WRHO0_RST
  *             - \ref WRHO1_RST
  *             - \ref GMAC0_RST
  *             - \ref GMAC1_RST
  *             - \ref HWSEM_RST
  *             - \ref EBI_RST
  *             - \ref HSUSBH0_RST
  *             - \ref HSUSBH1_RST
  *             - \ref HSUSBD_RST
  *             - \ref USBHL_RST
  *             - \ref SDH0_RST
  *             - \ref SDH1_RST
  *             - \ref NAND_RST
  *             - \ref GPIO_RST
  *             - \ref MCTLP_RST
  *             - \ref MCTLC_RST
  *             - \ref DDRPUB_RST
  *             - \ref TMR0_RST
  *             - \ref TMR1_RST
  *             - \ref TMR2_RST
  *             - \ref TMR3_RST
  *             - \ref I2C0_RST
  *             - \ref I2C1_RST
  *             - \ref I2C2_RST
  *             - \ref I2C3_RST
  *             - \ref QSPI0_RST
  *             - \ref SPI0_RST
  *             - \ref SPI1_RST
  *             - \ref SPI2_RST
  *             - \ref UART0_RST
  *             - \ref UART1_RST
  *             - \ref UART2_RST
  *             - \ref UART3_RST
  *             - \ref UART4_RST
  *             - \ref UART5_RST
  *             - \ref UART6_RST
  *             - \ref UART7_RST
  *             - \ref CANFD0_RST
  *             - \ref CANFD1_RST
  *             - \ref EADC0_RST
  *             - \ref I2S0_RST
  *             - \ref SC0_RST
  *             - \ref SC1_RST
  *             - \ref QSPI1_RST
  *             - \ref SPI3_RST
  *             - \ref EPWM0_RST
  *             - \ref EPWM1_RST
  *             - \ref QEI0_RST
  *             - \ref QEI1_RST
  *             - \ref ECAP0_RST
  *             - \ref ECAP1_RST
  *             - \ref CANFD2_RST
  *             - \ref ADC0_RST
  *             - \ref TMR4_RST
  *             - \ref TMR5_RST
  *             - \ref TMR6_RST
  *             - \ref TMR7_RST
  *             - \ref TMR8_RST
  *             - \ref TMR9_RST
  *             - \ref TMR10_RST
  *             - \ref TMR11_RST
  *             - \ref UART8_RST
  *             - \ref UART9_RST
  *             - \ref UART10_RST
  *             - \ref UART11_RST
  *             - \ref UART12_RST
  *             - \ref UART13_RST
  *             - \ref UART14_RST
  *             - \ref UART15_RST
  *             - \ref UART16_RST
  *             - \ref I2S1_RST
  *             - \ref I2C4_RST
  *             - \ref I2C5_RST
  *             - \ref EPWM2_RST
  *             - \ref ECAP2_RST
  *             - \ref QEI2_RST
  *             - \ref CANFD3_RST
  *             - \ref KPI_RST
  *             - \ref GIC_RST
  *             - \ref SSMCC_RST
  *             - \ref SSPCC_RST
  *
  * @details    This function reset selected module.
  */
void sysResetModule(uint32_t u32ModuleIndex)
{
    uint32_t u32tmpVal = 0UL;
	uint32_t u32tmpAddr = 0UL;

    /* Generate reset signal to the corresponding module */
    u32tmpVal = (1UL << (u32ModuleIndex & 0x00ffffffUL));
    u32tmpAddr = (uint32_t)&SYS->AHBIPRST + (u32ModuleIndex >> 24UL);
    M32(u32tmpAddr) |= u32tmpVal;

    /* Release corresponding module from reset state */
    u32tmpVal = ~(1UL << (u32ModuleIndex & 0x00ffffffUL));
    M32(u32tmpAddr) &= u32tmpVal;
}

/**
  * @brief      Enter to Power-down mode
  * @param      None
  * @return     None
  * @details    This function is used to let system enter to Power-down mode. \n
  *             The register write-protection function should be disabled before using this function.
  */
#ifdef _POWER_MANAGEMENT_
void sysEnterPowerDown(void)
{
	/* Crystal off (Power-down mode) */
    CLK_DisableXtalRC();

	/* Switches the processor into a low-power state */
    __wfi();
}
#endif

/**
  * @brief      Enter to Idle mode
  * @param      None
  * @return     None
  * @details    This function let system enter to Idle mode. \n
  *             The register write-protection function should be disabled before using this function.
  */
#ifdef _POWER_MANAGEMENT_
void sysEnterIdle(void)
{
    /* Switches the processor into a low-power state */
    __wfi();
}
#endif

#ifdef _POWER_MANAGEMENT_
#if defined ( __GNUC__ ) && !(__CC_ARM)
void __wfi(void)
{
    asm
    (
        "MCR p15, 0, r1, c7, c0, 4\n"
    );
}
#else
__asm void __wfi(void)
{
    MCR p15, 0, r1, c7, c0, 4
    BX  lr
}
#endif
#endif

/*@}*/ /* end of group SYS_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group SYS_Driver */

/*@}*/ /* end of group Standard_Driver */

/*** (C) COPYRIGHT 2025 Nuvoton Technology Corp. ***/
